<a href="https://colab.research.google.com/github/Allisonhanna/Projects/blob/main/SQL_education.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Описание

**employees** Таблица с информацией по сотрудникам

- emp_no - id сотрудника
- title - Название должности
- birth_date - дата рождения
- first_name - Имя
- first_name - Фамилия
- gender - пол
- hire_date - первая дата устройства на работу

**dept_emp** - Таблица с информацией в каком департаменте работает сотрудник

- emp_no - id сотрудника
- dept_name - Название департамента
- from_date - дата начала работы в департаменте
- to_date - дата ококнчания работы в департаменте (если 9999-01-01 - то работает по наст время)


**dept_manager** - Таблица с информацией в каком департаменте работает менеджер

- emp_no - id менеджера (сотрудника)
- dept_name - Название департамента
- from_date - дата начала работы в департаменте
- to_date - дата ококнчания работы в департаменте (если 9999-01-01 - то работает по наст время)


**salaries** - Таблица с информацией о зарплатах сотрудников

- emp_no - id сотрудника
- salaries - Зарплата

Укажите путь до места сохранения EmployeeSQL.db, данный путь был приведен в качестве примера

In [ ]:
%sql sqlite:///Files/EmployeeSQL.db

In [ ]:
%%sql

SELECT name FROM sqlite_master

 * sqlite:///Files/EmployeeSQL.db
Done.

[('employees',),
 ('dept_manager',),
 ('dept_emp',),
 ('salaries',),
 ('employees_10',),
 ('employees_3',),
 ('employees_4',)]

1) Выведим первые 10 строк из таблицы dept_emp

In [ ]:
%%sql

SELECT * from dept_emp
limit 10

 * sqlite:///Files/EmployeeSQL.db
Done.

[(10001, 'Development', '1986-06-26', '9999-01-01'),
 (10002, 'Sales', '1996-08-03', '9999-01-01'),
 (10003, 'Production', '1995-12-03', '9999-01-01'),
 (10004, 'Production', '1986-12-01', '9999-01-01'),
 (10005, 'Human Resources', '1989-09-12', '9999-01-01'),
 (10006, 'Development', '1990-08-05', '9999-01-01'),
 (10007, 'Research', '1989-02-10', '9999-01-01'),
 (10008, 'Development', '1998-03-11', '2000-07-31'),
 (10009, 'Quality Management', '1985-02-18', '9999-01-01'),
 (10010, 'Production', '1996-11-24', '2000-06-26')]

2) Сделаю 2ую таблицу employees_2 на основании employees, где создадите дополнительные столбцы:
- месяц рождения (по столбцу birth_date)
- год рождения (по столбцу birth_date)

Выведим первые 5 строк

In [ ]:
%%sql

drop table if exists employees_2;
create table if not exists employees_2 as

SELECT *, strftime('%m', birth_date) as month, strftime('%d', birth_date) as day
from employees

 * sqlite:///Files/EmployeeSQL.db
Done.
Done.

[]

In [ ]:
%%sql

SELECT * from employees_2
limit 5

 * sqlite:///Files/EmployeeSQL.db
Done.

[(10001, 'Senior Engineer', '1953-09-02', 'Georgi', 'Facello', 'M', '1986-06-26', '09', '02'),
 (10002, 'Staff', '1964-06-02', 'Bezalel', 'Simmel', 'F', '1985-11-21', '06', '02'),
 (10003, 'Senior Engineer', '1959-12-03', 'Parto', 'Bamford', 'M', '1986-08-28', '12', '03'),
 (10004, 'Senior Engineer', '1954-05-01', 'Chirstian', 'Koblick', 'M', '1986-12-01', '05', '01'),
 (10005, 'Staff', '1955-01-21', 'Kyoichi', 'Maliniak', 'M', '1989-09-12', '01', '21')]

3) Удалим таблицу employees_2

In [ ]:
%%sql

drop table if exists employees_2;

COMMIT

 * sqlite:///Files/EmployeeSQL.db
Done.
(sqlite3.OperationalError) cannot commit - no transaction is active
[SQL: COMMIT]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

4) Найдём всех сотрудников чье имя Georgi. Выведите первые 5 строк

In [ ]:
%%sql

SELECT * from employees
WHERE first_name = 'Georgi'
limit 5

 * sqlite:///Files/EmployeeSQL.db
Done.

[(10001, 'Senior Engineer', '1953-09-02', 'Georgi', 'Facello', 'M', '1986-06-26'),
 (10909, 'Senior Engineer', '1954-11-11', 'Georgi', 'Atchley', 'M', '1985-04-21'),
 (11029, 'Senior Staff', '1962-07-12', 'Georgi', 'Itzfeldt', 'M', '1992-12-27'),
 (11430, 'Staff', '1957-01-23', 'Georgi', 'Klassen', 'M', '1996-02-27'),
 (12157, 'Staff', '1960-03-30', 'Georgi', 'Barinka', 'M', '1985-06-04')]

5) Найдём всех сотрудников чье имя Georgi, которые до сих пор работают в компании. Выведим первые 5 строк, содержащих имя, фамилию, должность, дату начала работы, а также дату окончания работы (из dept_emp)

In [ ]:
%%sql

SELECT e.*, s.to_date
from employees as e
left join dept_emp as s on e.emp_no = s.emp_no
where first_name = 'Georgi' and to_date = '9999-01-01'
limit 5;

 * sqlite:///Files/EmployeeSQL.db
Done.

[(10001, 'Senior Engineer', '1953-09-02', 'Georgi', 'Facello', 'M', '1986-06-26', '9999-01-01'),
 (10909, 'Senior Engineer', '1954-11-11', 'Georgi', 'Atchley', 'M', '1985-04-21', '9999-01-01'),
 (11029, 'Senior Staff', '1962-07-12', 'Georgi', 'Itzfeldt', 'M', '1992-12-27', '9999-01-01'),
 (11430, 'Staff', '1957-01-23', 'Georgi', 'Klassen', 'M', '1996-02-27', '9999-01-01'),
 (12157, 'Staff', '1960-03-30', 'Georgi', 'Barinka', 'M', '1985-06-04', '9999-01-01')]

6) Выведим топ 2 заплаты в каждом департаменте.

In [ ]:
%%sql

with rank_salary as (
    select distinct(s.salary), dept_name,
    dense_rank() over(partition by dept_name order by s.salary desc) as rank
    from salaries s
    inner join dept_manager d on d.emp_no = s.emp_no
)
select dept_name, salary
from rank_salary
where rank < 3
order by dept_name

--господи как же я долго делал именно эту задачу, я придумал 3 разные идеи, но только с одной смог достичь, чтобы выписать 2 ЗП, а не одну

 * sqlite:///Files/EmployeeSQL.db
Done.

[('Customer Service', 53846),
 ('Customer Service', 40000),
 ('Development', 48626),
 ('Development', 40000),
 ('Finance', 60026),
 ('Finance', 52070),
 ('Human Resources', 48291),
 ('Human Resources', 40000),
 ('Marketing', 71166),
 ('Marketing', 69941),
 ('Production', 50365),
 ('Production', 42093),
 ('Quality Management', 61357),
 ('Quality Management', 50457),
 ('Research', 72446),
 ('Research', 48077),
 ('Sales', 71612),
 ('Sales', 71148)]

7) Найдите 2 по счету максимальную зарплату **среди менеджеров** **двумя способами обязательно!**:
- с использованием подзапроса
- с использованием limit

Вывести id менеджера и значение зарплаты

In [ ]:
%sql

select e.*, max(distinct(s.salary)) as salary
from employees e
left join salaries s on s.emp_no = e.emp_no
where salary not in (
    select max(salary)
    from salaries) and title = 'Manager'

SyntaxError: invalid syntax (2589036125.py, line 3)

In [ ]:
%%sql

select e.*, s.salary
from employees e
left join salaries s on s.emp_no = e.emp_no
where title = 'Manager'
order by salary desc

limit 1, 1

 * sqlite:///Files/EmployeeSQL.db
Done.

[(111035, 'Manager', '1962-02-24', 'Przemyslawa', 'Kaelbling', 'M', '1985-01-01', 71612)]

8) Выведим среднюю зарплату и название тех депаратаментов (dept_emp), где **среднее значение зарплаты** больше 50000

In [ ]:
%%sql

select d.dept_name, avg(s.salary) as avg_salary
from dept_emp d
inner join salaries s on s.emp_no = d.emp_no
group by dept_name
having avg_salary > 50000

 * sqlite:///Files/EmployeeSQL.db
Done.

[('Finance', 59533.51654560129),
 ('Marketing', 61095.89738261343),
 ('Sales', 69832.12715092354)]

9) Выведим среднюю зарплату по всем сотрудникам и округлим при помощи round()

In [ ]:
%%sql

select round(avg(salary)) as avg_salary
from salaries

 * sqlite:///Files/EmployeeSQL.db
Done.

[(52971.0,)]

10) Выведим первые 10 строк:
- id сотрудника (относится ко всем сотрудникам)
- Имя сотрудника
- Фамилию сотрудника
- Должность
- Департамент
- Зарплату (иметь в виду, что это число, а не строка)
- Дату начала работы в департаменте
- Дату окончания работы в департаменте
- **Флаг** того, что человек работает в данном депаратаменте (**если стоит дата 9999-01-01, то человек продолжает работать и ставим 1, иначе 0 (то есть уже не работает)**)
- Флаг того, что его зарплата выше средней, если **1 - выше средней или равно, иначе 0** (значение расчитано в задании 9, можно скопировать значение руками)

In [ ]:
%%sql

select e.*, d.to_date, d.dept_name, cast(s.salary as integer) as salary,
    case when (d.to_date = '9999-01-01') then 1 else 0 end as flg_curr,
    case when (s.salary > 52971.0) then 1 else 0 end as flg_avg_salary
from employees e
inner join dept_emp d on d.emp_no = e.emp_no
inner join salaries s on s.emp_no = e.emp_no

limit 10

 * sqlite:///Files/EmployeeSQL.db
Done.

[(10001, 'Senior Engineer', '1953-09-02', 'Georgi', 'Facello', 'M', '1986-06-26', '9999-01-01', 'Development', 60117, 1, 1),
 (10002, 'Staff', '1964-06-02', 'Bezalel', 'Simmel', 'F', '1985-11-21', '9999-01-01', 'Sales', 65828, 1, 1),
 (10003, 'Senior Engineer', '1959-12-03', 'Parto', 'Bamford', 'M', '1986-08-28', '9999-01-01', 'Production', 40006, 1, 0),
 (10004, 'Senior Engineer', '1954-05-01', 'Chirstian', 'Koblick', 'M', '1986-12-01', '9999-01-01', 'Production', 40054, 1, 0),
 (10005, 'Staff', '1955-01-21', 'Kyoichi', 'Maliniak', 'M', '1989-09-12', '9999-01-01', 'Human Resources', 78228, 1, 1),
 (10006, 'Senior Engineer', '1953-04-20', 'Anneke', 'Preusig', 'F', '1989-06-02', '9999-01-01', 'Development', 40000, 1, 0),
 (10007, 'Staff', '1957-05-23', 'Tzvetan', 'Zielinski', 'F', '1989-02-10', '9999-01-01', 'Research', 56724, 1, 1),
 (10008, 'Assistant Engineer', '1958-02-19', 'Saniya', 'Kalloufi', 'M', '1994-09-15', '2000-07-31', 'Development', 46671, 0, 0),
 (10009, 'Senior Engineer', '1952-04-19', 'Sumant', 'Peac', 'F', '1985-02-18', '9999-01-01', 'Quality Management', 60929, 1, 1),
 (10010, 'Engineer', '1963-06-01', 'Duangkaew', 'Piveteau', 'F', '1989-08-24', '2000-06-26', 'Production', 72488, 0, 1)]

11) Найдём уникальное количество пользователей в каждом департаменте

In [ ]:
%%sql

select d.dept_name, e.title, count(e.title) as count_emp
from dept_emp d
inner join employees e on d.emp_no = e.emp_no
group by dept_name, title

 * sqlite:///Files/EmployeeSQL.db
Done.

[('Customer Service', 'Assistant Engineer', 108),
 ('Customer Service', 'Engineer', 944),
 ('Customer Service', 'Manager', 4),
 ('Customer Service', 'Senior Engineer', 2027),
 ('Customer Service', 'Senior Staff', 4041),
 ('Customer Service', 'Staff', 16147),
 ('Customer Service', 'Technique Leader', 309),
 ('Development', 'Assistant Engineer', 2987),
 ('Development', 'Engineer', 23938),
 ('Development', 'Manager', 2),
 ('Development', 'Senior Engineer', 49326),
 ('Development', 'Senior Staff', 349),
 ('Development', 'Staff', 1424),
 ('Development', 'Technique Leader', 7681),
 ('Finance', 'Manager', 2),
 ('Finance', 'Senior Staff', 3415),
 ('Finance', 'Staff', 13929),
 ('Human Resources', 'Manager', 2),
 ('Human Resources', 'Senior Staff', 3443),
 ('Human Resources', 'Staff', 14341),
 ('Marketing', 'Manager', 2),
 ('Marketing', 'Senior Staff', 4013),
 ('Marketing', 'Staff', 16196),
 ('Production', 'Assistant Engineer', 2474),
 ('Production', 'Engineer', 20416),
 ('Production', 'Manager', 4),
 ('Production', 'Senior Engineer', 42203),
 ('Production', 'Senior Staff', 357),
 ('Production', 'Staff', 1478),
 ('Production', 'Technique Leader', 6553),
 ('Quality Management', 'Assistant Engineer', 735),
 ('Quality Management', 'Engineer', 5725),
 ('Quality Management', 'Manager', 4),
 ('Quality Management', 'Senior Engineer', 11863),
 ('Quality Management', 'Technique Leader', 1790),
 ('Research', 'Assistant Engineer', 127),
 ('Research', 'Engineer', 1245),
 ('Research', 'Manager', 2),
 ('Research', 'Senior Engineer', 2570),
 ('Research', 'Senior Staff', 3295),
 ('Research', 'Staff', 13494),
 ('Research', 'Technique Leader', 393),
 ('Sales', 'Manager', 2),
 ('Sales', 'Senior Staff', 10437),
 ('Sales', 'Staff', 41806)]